{
    "title": "First Impressions",
    "chapter_theme": "The Ordinary World / Call to Adventure",
    "description": "You arrive in the bustling, chaotic Thetopia Town Square, a stark contrast to the quiet forests you barely remember. Your companion porcupine trembles slightly. Take a moment to get your bearings and describe your initial reaction to this strange new place.",
    "starting_step": "STEP_01_OBSERVE_SQUARE",
    "completion_reward": {
        "type": "fate_points",
        "value": 1
    },
    "steps": {
        "STEP_01_OBSERVE_SQUARE": {
            "description": "Look around the Town Square. Describe what catches your eye first – the shimmering pavement, the murmuring fountain, the diverse inhabitants. How does your large, natural Sasquatch form feel in this artificial place? How does your porcupine companion react?",
            "trigger_condition": "ai_check:initial_description_provided",
            "step_reward": null,
            "next_step": "STEP_02_FIND_ANCHOR",
            "is_major_plot_point": false
        },
        "STEP_02_FIND_ANCHOR": {
            "description": "Amidst the strangeness, find one element that feels somewhat familiar or grounding. Is it a patch of synthesized moss, the sight of Guard Captain Elena's disciplined presence, or something else? Describe what you focus on.",
            "trigger_condition": "ai_check:anchor_point_described",
            "step_reward": null,
            "next_step": "STEP_03_FOCUS_SENSES",
            "is_major_plot_point": false
        },
        "STEP_03_FOCUS_SENSES": {
            "description": "Focus your senses, particularly smell and hearing. What distinct sound or scent cuts through the general background noise? Perhaps the synthesized bread from Bakery Street, or the metallic tang from Maker's Alley? Describe the specific sensation.",
            "trigger_condition": "ai_check:specific_sensation_identified",
            "step_reward": {
                "type": "info",
                "details": "You've managed to isolate a specific sensory detail amidst the chaos.",
                "silent": true
            },
            "next_step": "STEP_04_CONSIDER_ACTION",
            "is_major_plot_point": false
        },
        "STEP_04_CONSIDER_ACTION": {
            "description": "Based on your observations and focused sense, what is your first instinctual action as a Soldier? Secure your position, investigate the scent/sound, or perhaps just continue observing warily? Describe your intended first move.",
            "trigger_condition": "ai_check:first_action_described",
            "step_reward": null,
            "next_step": null,
            "is_major_plot_point": true
        }
    }
}